STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215cxx_cm33.h
#define HASH2_DIGEST                HASH2_DIGEST_NS
#define HASH2_DIGEST_BASE           HASH2_DIGEST_BASE_NS

#define RNG1                        RNG1_NS
#define RNG1_BASE                   RNG1_BASE_NS

#define RNG2                        RNG2_NS
#define RNG2_BASE                   RNG2_BASE_NS

#define CRYP1                       CRYP1_NS
#define CRYP1_BASE                  CRYP1_BASE_NS

#define CRYP2                       CRYP2_NS
#define CRYP2_BASE                  CRYP2_BASE_NS

#define SAES                        SAES_NS
#define SAES_BASE                   SAES_BASE_NS

#define PKA                         PKA_NS
#define PKA_BASE                    PKA_BASE_NS

#define RAMCFG                      RAMCFG_NS
#define RAMCFG_BASE                 RAMCFG_BASE_NS

#define RAMCFG_SYSRAM               RAMCFG_SYSRAM_NS
#define RAMCFG_SYSRAM_BASE          RAMCFG_SYSRAM_BASE_NS

#define RAMCFG_SRAM1                RAMCFG_SRAM1_NS
#define RAMCFG_SRAM1_BASE           RAMCFG_SRAM1_BASE_NS

#define RAMCFG_SRAM2                RAMCFG_SRAM2_NS
#define RAMCFG_SRAM2_BASE           RAMCFG_SRAM2_BASE_NS

#define RAMCFG_RETRAM               RAMCFG_RETRAM_NS
#define RAMCFG_RETRAM_BASE          RAMCFG_RETRAM_BASE_NS

#define RAMCFG_BKPSRAM              RAMCFG_BKPSRAM_NS
#define RAMCFG_BKPSRAM_BASE         RAMCFG_BKPSRAM_BASE_NS


#define RIFSC                       RIFSC_NS
#define RIFSC_BASE                  RIFSC_BASE_NS

#define RISC                        RISC_NS
#define RISC_BASE                   RISC_BASE_NS

#define RIMC                        RIMC_NS
#define RIMC_BASE                   RIMC_BASE_NS

#define RIFSC_ID                    RIFSC_ID_NS
#define RIFSC_ID_BASE               RIFSC_ID_BASE_NS

#define IAC                         IAC_NS
#define IAC_BASE                    IAC_BASE_NS

#define RISAF1                      RISAF1_NS
#define RISAF1_BASE                 RISAF1_BASE_NS

#define RISAF2                      RISAF2_NS
#define RISAF2_BASE                 RISAF2_BASE_NS

#define RISAF4                      RISAF4_NS
#define RISAF4_BASE                 RISAF4_BASE_NS


#define RISAB1                      RISAB1_NS
#define RISAB1_BASE                 RISAB1_BASE_NS

#define RISAB2                      RISAB2_NS
#define RISAB2_BASE                 RISAB2_BASE_NS

#define RISAB3                      RISAB3_NS
#define RISAB3_BASE                 RISAB3_BASE_NS


#define RISAB5                      RISAB5_NS
#define RISAB5_BASE                 RISAB5_BASE_NS


/*!< APB3 peripherals defaults to Non secure aliases */
#define BSEC                        BSEC_NS
#define BSEC_BASE                   BSEC_BASE_NS

#define IWDG1                       IWDG1_NS
#define IWDG1_BASE                  IWDG1_BASE_NS

#define IWDG2                       IWDG2_NS
#define IWDG2_BASE                  IWDG2_BASE_NS

#define IWDG3                       IWDG3_NS
#define IWDG3_BASE                  IWDG3_BASE_NS

#define IWDG4                       IWDG4_NS
#define IWDG4_BASE                  IWDG4_BASE_NS

#define WWDG1                       WWDG1_NS
#define WWDG1_BASE                  WWDG1_BASE_NS

#define VREFBUF                     VREFBUF_NS
#define VREFBUF_BASE                VREFBUF_BASE_NS

#define DTS                         DTS_NS
#define DTS_BASE                    DTS_BASE_NS

#define SERC                        SERC_NS
#define SERC_BASE                   SERC_BASE_NS

#define HDP                         HDP_NS
#define HDP_BASE                    HDP_BASE_NS

/*!< AHB4 peripherals defaults to Non secure aliases */
#define RCC                         RCC_NS
#define RCC_BASE                    RCC_BASE_NS

#define PWR                         PWR_NS
#define PWR_BASE                    PWR_BASE_NS

#define EXTI1                       EXTI1_NS
#define EXTI1_BASE                  EXTI1_BASE_NS

#define EXTI1_C1                    EXTI1_C1_NS
#define EXTI1_C1_BASE               EXTI1_C1_BASE_NS

#define EXTI1_C2                    EXTI1_C2_NS
#define EXTI1_C2_BASE               EXTI1_C2_BASE_NS

#define SYSCFG                      SYSCFG_NS
#define SYSCFG_BASE                 SYSCFG_BASE_NS

#define GPIOA                       GPIOA_NS
#define GPIOA_BASE                  GPIOA_BASE_NS

#define GPIOB                       GPIOB_NS
#define GPIOB_BASE                  GPIOB_BASE_NS

#define GPIOC                       GPIOC_NS
#define GPIOC_BASE                  GPIOC_BASE_NS

#define GPIOD                       GPIOD_NS
#define GPIOD_BASE                  GPIOD_BASE_NS

#define GPIOE                       GPIOE_NS
#define GPIOE_BASE                  GPIOE_BASE_NS

#define GPIOF                       GPIOF_NS
#define GPIOF_BASE                  GPIOF_BASE_NS

#define GPIOG                       GPIOG_NS
#define GPIOG_BASE                  GPIOG_BASE_NS

#define GPIOH                       GPIOH_NS
#define GPIOH_BASE                  GPIOH_BASE_NS

#define GPIOI                       GPIOI_NS
#define GPIOI_BASE                  GPIOI_BASE_NS

/*!< SMART_RUN_APB peripherals defaults to Non secure aliases */
#define RTC                         RTC_NS
#define RTC_BASE                    RTC_BASE_NS

#define TAMP                        TAMP_NS
#define TAMP_BASE                   TAMP_BASE_NS

#define SPI6                        SPI6_NS
#define SPI6_BASE                   SPI6_BASE_NS

#define LPUART1                     LPUART1_NS
#define LPUART1_BASE                LPUART1_BASE_NS


#define LPTIM3                      LPTIM3_NS
#define LPTIM3_BASE                 LPTIM3_BASE_NS

#define LPTIM4                      LPTIM4_NS
#define LPTIM4_BASE                 LPTIM4_BASE_NS

#define LPTIM5                      LPTIM5_NS
#define LPTIM5_BASE                 LPTIM5_BASE_NS


/*!< SMART_RUN_AHB peripherals defaults to Non secure aliases */
#define GPIOZ                       GPIOZ_NS
#define GPIOZ_BASE                  GPIOZ_BASE_NS

#define ADF1                        ADF1_NS
#define ADF1_BASE                   ADF1_BASE_NS

#define ADF1_Filter0                ADF1_Filter0_NS
#define ADF1_Filter0_BASE           ADF1_Filter0_BASE_NS

