STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215cxx_cm33.h
/***************  Bit definition for FMC_BCHDSR4 register  ****************/
#define FMC_BCHDSR4_EBP7_Pos          (0U)
#define FMC_BCHDSR4_EBP7_Msk          (0x1FFFUL << FMC_BCHDSR4_EBP7_Pos)      /*!< 0x00001FFF */
#define FMC_BCHDSR4_EBP7              FMC_BCHDSR4_EBP7_Msk                   /*!< Error bit position for error number 7 */
#define FMC_BCHDSR4_EBP8_Pos          (16U)
#define FMC_BCHDSR4_EBP8_Msk          (0x1FFFUL << FMC_BCHDSR4_EBP8_Pos)      /*!< 0x1FFF0000 */
#define FMC_BCHDSR4_EBP8              FMC_BCHDSR4_EBP8_Msk                   /*!< Error bit position for error number 8 */

/***************  Bit definition for FMC_SECCFGR register  ****************/
#define FMC_SECCFGR_SEC0_Pos          (0U)
#define FMC_SECCFGR_SEC0_Msk          (0x1UL << FMC_SECCFGR_SEC0_Pos)         /*!< 0x00000001 */
#define FMC_SECCFGR_SEC0              FMC_SECCFGR_SEC0_Msk                   /*!< Security state for FMC_CFGR common control register */
#define FMC_SECCFGR_SEC1_Pos          (1U)
#define FMC_SECCFGR_SEC1_Msk          (0x1UL << FMC_SECCFGR_SEC1_Pos)         /*!< 0x00000002 */
#define FMC_SECCFGR_SEC1              FMC_SECCFGR_SEC1_Msk                   /*!< Security state for NOR/PSRAM controller for Chip Select NE1 */
#define FMC_SECCFGR_SEC2_Pos          (2U)
#define FMC_SECCFGR_SEC2_Msk          (0x1UL << FMC_SECCFGR_SEC2_Pos)         /*!< 0x00000004 */
#define FMC_SECCFGR_SEC2              FMC_SECCFGR_SEC2_Msk                   /*!< Security state for NOR/PSRAM controller for Chip Select NE2 */
#define FMC_SECCFGR_SEC3_Pos          (3U)
#define FMC_SECCFGR_SEC3_Msk          (0x1UL << FMC_SECCFGR_SEC3_Pos)         /*!< 0x00000008 */
#define FMC_SECCFGR_SEC3              FMC_SECCFGR_SEC3_Msk                   /*!< Security state for NOR/PSRAM controller for Chip Select NE3 */
#define FMC_SECCFGR_SEC4_Pos          (4U)
#define FMC_SECCFGR_SEC4_Msk          (0x1UL << FMC_SECCFGR_SEC4_Pos)         /*!< 0x00000010 */
#define FMC_SECCFGR_SEC4              FMC_SECCFGR_SEC4_Msk                   /*!< Security state for NOR/PSRAM controller for Chip Select NE4 */
#define FMC_SECCFGR_SEC5_Pos          (5U)
#define FMC_SECCFGR_SEC5_Msk          (0x1UL << FMC_SECCFGR_SEC5_Pos)         /*!< 0x00000020 */
#define FMC_SECCFGR_SEC5              FMC_SECCFGR_SEC5_Msk                   /*!< Security configuration for NAND controller */

/***************  Bit definition for FMC_PRIVCFGR register  ***************/
#define FMC_PRIVCFGR_PRIV0_Pos        (0U)
#define FMC_PRIVCFGR_PRIV0_Msk        (0x1UL << FMC_PRIVCFGR_PRIV0_Pos)       /*!< 0x00000001 */
#define FMC_PRIVCFGR_PRIV0            FMC_PRIVCFGR_PRIV0_Msk                 /*!< Privileged state for common control: FMC_CFGR */
#define FMC_PRIVCFGR_PRIV1_Pos        (1U)
#define FMC_PRIVCFGR_PRIV1_Msk        (0x1UL << FMC_PRIVCFGR_PRIV1_Pos)       /*!< 0x00000002 */
#define FMC_PRIVCFGR_PRIV1            FMC_PRIVCFGR_PRIV1_Msk                 /*!< Privileged state for NOR/PSRAM controller for Chip Select NE1 */
#define FMC_PRIVCFGR_PRIV2_Pos        (2U)
#define FMC_PRIVCFGR_PRIV2_Msk        (0x1UL << FMC_PRIVCFGR_PRIV2_Pos)       /*!< 0x00000004 */
#define FMC_PRIVCFGR_PRIV2            FMC_PRIVCFGR_PRIV2_Msk                 /*!< Privileged state for NOR/PSRAM controller for Chip Select NE2 */
#define FMC_PRIVCFGR_PRIV3_Pos        (3U)
#define FMC_PRIVCFGR_PRIV3_Msk        (0x1UL << FMC_PRIVCFGR_PRIV3_Pos)       /*!< 0x00000008 */
#define FMC_PRIVCFGR_PRIV3            FMC_PRIVCFGR_PRIV3_Msk                 /*!< Privileged state for NOR/PSRAM controller for Chip Select NE3 */
#define FMC_PRIVCFGR_PRIV4_Pos        (4U)
#define FMC_PRIVCFGR_PRIV4_Msk        (0x1UL << FMC_PRIVCFGR_PRIV4_Pos)       /*!< 0x00000010 */
#define FMC_PRIVCFGR_PRIV4            FMC_PRIVCFGR_PRIV4_Msk                 /*!< Privileged state for NOR/PSRAM controller for Chip Select NE4 */
#define FMC_PRIVCFGR_PRIV5_Pos        (5U)
#define FMC_PRIVCFGR_PRIV5_Msk        (0x1UL << FMC_PRIVCFGR_PRIV5_Pos)       /*!< 0x00000020 */
#define FMC_PRIVCFGR_PRIV5            FMC_PRIVCFGR_PRIV5_Msk                 /*!< Privileged state for NAND controller */

/***************  Bit definition for FMC_RCFGLOCK register  ***************/
#define FMC_RCFGLOCK_LOCK0_Pos        (0U)
#define FMC_RCFGLOCK_LOCK0_Msk        (0x1UL << FMC_RCFGLOCK_LOCK0_Pos)       /*!< 0x00000001 */
#define FMC_RCFGLOCK_LOCK0            FMC_RCFGLOCK_LOCK0_Msk                 /*!< Lock FMC_CFGR until a global FMC reset */
#define FMC_RCFGLOCK_LOCK1_Pos        (1U)
#define FMC_RCFGLOCK_LOCK1_Msk        (0x1UL << FMC_RCFGLOCK_LOCK1_Pos)       /*!< 0x00000002 */
#define FMC_RCFGLOCK_LOCK1            FMC_RCFGLOCK_LOCK1_Msk                 /*!< Lock NOR/PSRAM controller for Chip Select NE1 until a global FMC reset */
#define FMC_RCFGLOCK_LOCK2_Pos        (2U)
#define FMC_RCFGLOCK_LOCK2_Msk        (0x1UL << FMC_RCFGLOCK_LOCK2_Pos)       /*!< 0x00000004 */
#define FMC_RCFGLOCK_LOCK2            FMC_RCFGLOCK_LOCK2_Msk                 /*!< Lock NOR/PSRAM controller for Chip Select NE2 until a global FMC reset */
#define FMC_RCFGLOCK_LOCK3_Pos        (3U)
#define FMC_RCFGLOCK_LOCK3_Msk        (0x1UL << FMC_RCFGLOCK_LOCK3_Pos)       /*!< 0x00000008 */
#define FMC_RCFGLOCK_LOCK3            FMC_RCFGLOCK_LOCK3_Msk                 /*!< Lock NOR/PSRAM controller for Chip Select NE3 until a global FMC reset */
#define FMC_RCFGLOCK_LOCK4_Pos        (4U)
#define FMC_RCFGLOCK_LOCK4_Msk        (0x1UL << FMC_RCFGLOCK_LOCK4_Pos)       /*!< 0x00000010 */
#define FMC_RCFGLOCK_LOCK4            FMC_RCFGLOCK_LOCK4_Msk                 /*!< Lock NOR/PSRAM controller for Chip Select NE4 until a global FMC reset */
#define FMC_RCFGLOCK_LOCK5_Pos        (5U)
#define FMC_RCFGLOCK_LOCK5_Msk        (0x1UL << FMC_RCFGLOCK_LOCK5_Pos)       /*!< 0x00000020 */
#define FMC_RCFGLOCK_LOCK5            FMC_RCFGLOCK_LOCK5_Msk                 /*!< Lock NAND controller until a global FMC reset */

/*****************  Bit definition for FMC_CIDCFGR0 register  *****************/
#define FMC_CIDCFGR0_CFEN_Pos         (0U)
#define FMC_CIDCFGR0_CFEN_Msk         (0x1UL << FMC_CIDCFGR0_CFEN_Pos)        /*!< 0x00000001 */
#define FMC_CIDCFGR0_CFEN             FMC_CIDCFGR0_CFEN_Msk                  /*!< CID filtering enable for resource x */
#define FMC_CIDCFGR0_SEMEN_Pos        (1U)
#define FMC_CIDCFGR0_SEMEN_Msk        (0x1UL << FMC_CIDCFGR0_SEMEN_Pos)       /*!< 0x00000002 */
#define FMC_CIDCFGR0_SEMEN            FMC_CIDCFGR0_SEMEN_Msk                 /*!< Semaphore enable for resource x */
#define FMC_CIDCFGR0_SCID_Pos         (4U)
#define FMC_CIDCFGR0_SCID_Msk         (0x7UL << FMC_CIDCFGR0_SCID_Pos)        /*!< 0x00000070 */
#define FMC_CIDCFGR0_SCID             FMC_CIDCFGR0_SCID_Msk                  /*!< Static CID for resource x */
#define FMC_CIDCFGR0_SEMWLC0_Pos      (16U)
#define FMC_CIDCFGR0_SEMWLC0_Msk      (0x1UL << FMC_CIDCFGR0_SEMWLC0_Pos)     /*!< 0x00010000 */
#define FMC_CIDCFGR0_SEMWLC0          FMC_CIDCFGR0_SEMWLC0_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR0_SEMWLC1_Pos      (17U)
#define FMC_CIDCFGR0_SEMWLC1_Msk      (0x1UL << FMC_CIDCFGR0_SEMWLC1_Pos)     /*!< 0x00020000 */
#define FMC_CIDCFGR0_SEMWLC1          FMC_CIDCFGR0_SEMWLC1_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR0_SEMWLC2_Pos      (18U)
#define FMC_CIDCFGR0_SEMWLC2_Msk      (0x1UL << FMC_CIDCFGR0_SEMWLC2_Pos)     /*!< 0x00040000 */
#define FMC_CIDCFGR0_SEMWLC2          FMC_CIDCFGR0_SEMWLC2_Msk               /*!< white-listed CID in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR0_SEMWLC3_Pos      (19U)
#define FMC_CIDCFGR0_SEMWLC3_Msk      (0x1UL << FMC_CIDCFGR0_SEMWLC3_Pos)     /*!< 0x00080000 */
#define FMC_CIDCFGR0_SEMWLC3          FMC_CIDCFGR0_SEMWLC3_Msk               /*!< white-listed CID in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR0_SEMWLC4_Pos      (20U)
#define FMC_CIDCFGR0_SEMWLC4_Msk      (0x1UL << FMC_CIDCFGR0_SEMWLC4_Pos)     /*!< 0x00100000 */
#define FMC_CIDCFGR0_SEMWLC4          FMC_CIDCFGR0_SEMWLC4_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR0_SEMWLC5_Pos      (21U)
#define FMC_CIDCFGR0_SEMWLC5_Msk      (0x1UL << FMC_CIDCFGR0_SEMWLC5_Pos)     /*!< 0x00200000 */
#define FMC_CIDCFGR0_SEMWLC5          FMC_CIDCFGR0_SEMWLC5_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR0_SEMWLC6_Pos      (22U)
#define FMC_CIDCFGR0_SEMWLC6_Msk      (0x1UL << FMC_CIDCFGR0_SEMWLC6_Pos)     /*!< 0x00400000 */
#define FMC_CIDCFGR0_SEMWLC6          FMC_CIDCFGR0_SEMWLC6_Msk               /*!< white-listed CID0 in the CID allocation pool of resource x in semaphore mode */
#define FMC_CIDCFGR0_SEMWLC7_Pos      (23U)
#define FMC_CIDCFGR0_SEMWLC7_Msk      (0x1UL << FMC_CIDCFGR0_SEMWLC7_Pos)     /*!< 0x00800000 */
#define FMC_CIDCFGR0_SEMWLC7          FMC_CIDCFGR0_SEMWLC7_Msk               /*!< White-listed CID0 in the CID allocation pool of resource x in semaphore mode */

