STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215cxx_cm33.h
#define IAC_VERR_MAJREV_Pos           (4U)
#define IAC_VERR_MAJREV_Msk           (0xFUL << IAC_VERR_MAJREV_Pos)             /*!< 0x000000F0 */
#define IAC_VERR_MAJREV               IAC_VERR_MAJREV_Msk

/*******************  Bits definition for IAC_IPIDR register ******************/
#define IAC_IPIDR_ID_Pos              (0U)
#define IAC_IPIDR_ID_Msk              (0xFFFFFFFFUL << IAC_IPIDR_ID_Pos)         /*!< 0xFFFFFFFF */
#define IAC_IPIDR_ID                  IAC_IPIDR_ID_Msk

/*******************  Bits definition for IAC_SIDR register *******************/
#define IAC_SIDR_SID_Pos              (0U)
#define IAC_SIDR_SID_Msk              (0xFFFFFFFFUL << IAC_SIDR_SID_Pos)         /*!< 0xFFFFFFFF */
#define IAC_SIDR_SID                  IAC_SIDR_SID_Msk

/******************************************************************************/
/*                                                                            */
/*                                    RNG                                     */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for RNG_CR register  *******************/
#define RNG_CR_RNGEN_Pos            (2U)
#define RNG_CR_RNGEN_Msk            (0x1UL << RNG_CR_RNGEN_Pos)            /*!< 0x00000004 */
#define RNG_CR_RNGEN                RNG_CR_RNGEN_Msk                      /*!< True random number generator enable */
#define RNG_CR_IE_Pos               (3U)
#define RNG_CR_IE_Msk               (0x1UL << RNG_CR_IE_Pos)               /*!< 0x00000008 */
#define RNG_CR_IE                   RNG_CR_IE_Msk                         /*!< Interrupt Enable */
#define RNG_CR_CED_Pos              (5U)
#define RNG_CR_CED_Msk              (0x1UL << RNG_CR_CED_Pos)              /*!< 0x00000020 */
#define RNG_CR_CED                  RNG_CR_CED_Msk                        /*!< Clock error detection  */
#define RNG_CR_ARDIS_Pos            (7U)
#define RNG_CR_ARDIS_Msk            (0x1UL << RNG_CR_ARDIS_Pos)            /*!< 0x00000080 */
#define RNG_CR_ARDIS                RNG_CR_ARDIS_Msk                      /*!< Auto reset disable */
#define RNG_CR_NISTC_Pos            (12U)
#define RNG_CR_NISTC_Msk            (0x1UL << RNG_CR_NISTC_Pos)            /*!< 0x00001000 */
#define RNG_CR_NISTC                RNG_CR_NISTC_Msk                      /*!< NIST custom */
#define RNG_CR_CLKDIV_Pos           (16U)
#define RNG_CR_CLKDIV_Msk           (0xFUL << RNG_CR_CLKDIV_Pos)           /*!< 0x000F0000 */
#define RNG_CR_CLKDIV_0             (0x1UL << RNG_CR_CLKDIV_Pos)           /*!< 0x00010000 */
#define RNG_CR_CLKDIV_1             (0x2UL << RNG_CR_CLKDIV_Pos)           /*!< 0x00020000 */
#define RNG_CR_CLKDIV_2             (0x4UL << RNG_CR_CLKDIV_Pos)           /*!< 0x00040000 */
#define RNG_CR_CLKDIV_3             (0x8UL << RNG_CR_CLKDIV_Pos)
#define RNG_CR_CLKDIV               RNG_CR_CLKDIV_Msk                     /*!< Clock divider factor */
#define RNG_CR_CONDRST_Pos          (30U)
#define RNG_CR_CONDRST_Msk          (0x1UL << RNG_CR_CONDRST_Pos)          /*!< 0x40000000 */
#define RNG_CR_CONDRST              RNG_CR_CONDRST_Msk                    /*!< Conditioning soft reset */
#define RNG_CR_CONFIGLOCK_Pos       (31U)
#define RNG_CR_CONFIGLOCK_Msk       (0x1UL << RNG_CR_CONFIGLOCK_Pos)       /*!< 0x80000000 */
#define RNG_CR_CONFIGLOCK           RNG_CR_CONFIGLOCK_Msk                 /*!< RNG config lock */

#define RNG_CR_RNG_CONFIG1_Pos      (20U)
#define RNG_CR_RNG_CONFIG1_Msk      (0xFFUL << RNG_CR_RNG_CONFIG1_Pos)    /*!< 0x0FF00000 */
#define RNG_CR_RNG_CONFIG1          RNG_CR_RNG_CONFIG1_Msk                /*!< RNG CONFIG1 */
#define RNG_CR_RNG_CONFIG2_Pos      (13U)
#define RNG_CR_RNG_CONFIG2_Msk      (0x7UL << RNG_CR_RNG_CONFIG2_Pos)     /*!< 0x0000E000 */
#define RNG_CR_RNG_CONFIG2          RNG_CR_RNG_CONFIG2_Msk                /*!< RNG CONFIG2 */
#define RNG_CR_RNG_CONFIG3_Pos      (8U)
#define RNG_CR_RNG_CONFIG3_Msk      (0xFUL << RNG_CR_RNG_CONFIG3_Pos)     /*!< 0x00000F00 */
#define RNG_CR_RNG_CONFIG3          RNG_CR_RNG_CONFIG3_Msk                /*!< RNG CONFIG3 */

/*****************  Bit definition for RNG_SR register  ******************/
#define RNG_SR_DRDY_Pos             (0U)
#define RNG_SR_DRDY_Msk             (0x1UL << RNG_SR_DRDY_Pos)             /*!< 0x00000001 */
#define RNG_SR_DRDY                 RNG_SR_DRDY_Msk                       /*!< Data Ready */
#define RNG_SR_CECS_Pos             (1U)
#define RNG_SR_CECS_Msk             (0x1UL << RNG_SR_CECS_Pos)             /*!< 0x00000002 */
#define RNG_SR_CECS                 RNG_SR_CECS_Msk                       /*!< Clock error current status */
#define RNG_SR_SECS_Pos             (2U)
#define RNG_SR_SECS_Msk             (0x1UL << RNG_SR_SECS_Pos)             /*!< 0x00000004 */
#define RNG_SR_SECS                 RNG_SR_SECS_Msk                       /*!< Seed error current status */
#define RNG_SR_BUSY_Pos             (4U)
#define RNG_SR_BUSY_Msk             (0x1UL << RNG_SR_BUSY_Pos)             /*!< 0x00000010 */
#define RNG_SR_BUSY                 RNG_SR_BUSY_Msk                       /*!< Busy */
#define RNG_SR_CEIS_Pos             (5U)
#define RNG_SR_CEIS_Msk             (0x1UL << RNG_SR_CEIS_Pos)             /*!< 0x00000020 */
#define RNG_SR_CEIS                 RNG_SR_CEIS_Msk                       /*!< Clock error interrupt status */
#define RNG_SR_SEIS_Pos             (6U)
#define RNG_SR_SEIS_Msk             (0x1UL << RNG_SR_SEIS_Pos)             /*!< 0x00000040 */
#define RNG_SR_SEIS                 RNG_SR_SEIS_Msk                       /*!< Seed error interrupt status */

/****************  Bit definition for RNG_NSCR register  *****************/
#define RNG_NSCR_EN_OSC1_Pos        (0U)
#define RNG_NSCR_EN_OSC1_Msk        (0x7UL << RNG_NSCR_EN_OSC1_Pos)        /*!< 0x00000007 */
#define RNG_NSCR_EN_OSC1            RNG_NSCR_EN_OSC1_Msk                  /*!< None */
#define RNG_NSCR_EN_OSC2_Pos        (3U)
#define RNG_NSCR_EN_OSC2_Msk        (0x7UL << RNG_NSCR_EN_OSC2_Pos)        /*!< 0x00000038 */
#define RNG_NSCR_EN_OSC2            RNG_NSCR_EN_OSC2_Msk                  /*!< None */
#define RNG_NSCR_EN_OSC3_Pos        (6U)
#define RNG_NSCR_EN_OSC3_Msk        (0x7UL << RNG_NSCR_EN_OSC3_Pos)        /*!< 0x000001C0 */
#define RNG_NSCR_EN_OSC3            RNG_NSCR_EN_OSC3_Msk                  /*!< None */

/****************  Bit definition for RNG_HTCR0 register  ****************/
#define RNG_HTCR0_HTCFG_Pos         (0U)
#define RNG_HTCR0_HTCFG_Msk         (0xFFFFFFFFUL << RNG_HTCR0_HTCFG_Pos)  /*!< 0xFFFFFFFF */
#define RNG_HTCR0_HTCFG             RNG_HTCR0_HTCFG_Msk                   /*!< health test configuration */

/****************  Bit definition for RNG_HTCR1 register  ****************/
#define RNG_HTCR1_HTCFG_Pos         (0U)
#define RNG_HTCR1_HTCFG_Msk         (0xFFFFFFFFUL << RNG_HTCR1_HTCFG_Pos)  /*!< 0xFFFFFFFF */
#define RNG_HTCR1_HTCFG             RNG_HTCR1_HTCFG_Msk                   /*!< health test configuration */

/****************  Bit definition for RNG_HTCR2 register  ****************/
#define RNG_HTCR2_HTCFG_Pos         (0U)
#define RNG_HTCR2_HTCFG_Msk         (0xFFFFFFFFUL << RNG_HTCR2_HTCFG_Pos)  /*!< 0xFFFFFFFF */
#define RNG_HTCR2_HTCFG             RNG_HTCR2_HTCFG_Msk                   /*!< health test configuration */

/****************  Bit definition for RNG_HTCR3 register  ****************/
#define RNG_HTCR3_HTCFG_Pos         (0U)
#define RNG_HTCR3_HTCFG_Msk         (0xFFFFFFFFUL << RNG_HTCR3_HTCFG_Pos)  /*!< 0xFFFFFFFF */
#define RNG_HTCR3_HTCFG             RNG_HTCR3_HTCFG_Msk                   /*!< health test configuration */

